import math

x=input('чё неизвестно? Если неизвестно что-то ещё то когда будут спрашивать значения пиши 0')
if x==('i'):
    I=int(input('I=?'))
    x=input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if x==('биты'):
        I=I
    if x==('байты'):
        I=I*8
    if x==('гигабайты'):
        I=I*8589934592
    if x==('килобайты'):
        I=I*8192
    K=int(input('K=?'))
    N=int(input('N=?'))
    z=input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if z==('биты'):
        N=N
    if z==('байты'):
        N=N*8
    if z==('гигабайты'):
        N=N*8589934592
    if z==('килобайты'):
        N=N*8192
    if I==0 or K==0:
        i=math.log2(N)
    i=I//K
    print(i)
if x==('I'):
    i=int(input('i=?'))
    r=input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if r==('биты'):
        i=i
    if r==('байты'):
        i=i*8
    if r==('гигабайты'):
        i=i*8589934592
    if r==('килобайты'):
        i=i*8192
    K=int(input('K=?'))
    N=int(input('N=?'))
    y=input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if y==('биты'):
        N=N
    if y==('байты'):
        N=N*8
    if y==('гигабайты'):
        N=N*8589934592
    if y==('килобайты'):
        N=N*8192
    if  i==0:
        i=math.log2(N)
    I=K*i
    print(I)
if x==('K'):
    i=int(input('i=?'))
    t=input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if t==('биты'):
        i=i
    if t==('байты'):
        i=i*8
    if t==('гигабайты'):
        i=i*8589934592
    if t==('килобайты'):
        i=i*8192
    I=int(input('I=?'))
    b=input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if b==('биты'):
        I=I
    if b==('байты'):
        I=I*8
    if b==('гигабайты'):
        I=I*8589934592
    if b==('килобайты'):
        I=I*8192
    N=int(input('N=?'))
    n=input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if n==('биты'):
        N=N
    if n==('байты'):
        N=N*8
    if n==('гигабайты'):
        N=N*8589934592
    if n==('килобайты'):
        N=N*8192
    if i==0:
        i=math.log2(N)
    K=I//i
    print(K)
if x==('N'):
    i=int(input('i=?'))
    p=input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if p==('биты'):
        i=i
    if p==('байты'):
        i=i*8
    if p==('гигабайты'):
        i=i*8589934592
    if p==('килобайты'):
        i=i*8192
    I=int(input('I=?'))
    o=input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if o==('биты'):
        I=I
    if o==('байты'):
        I=I*8
    if o==('гигабайты'):
        I=I*8589934592
    if o==('килобайты'):
        I=I*8192
    K=int(input('K=?'))
    if i==0:
        i=I//K
    N=2**i
    print(N)


    


