import math

x=input('чё неизвестно? Если неизвестно 2 и более величины то когда их будут спрашивать пиши 0')
if x==('H'):
    t = int(input('t=?'))
    y=input('секунды или минуты? Пиши слово с мелкой буквы')
    if y==('минуты'):
        t=t*60
    N = int(input('N=?'))
    K = int(input('K=?'))
    b = int(input('b=?'))
    x = input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if x == ('байты'):
        b = b * 8
    if x == ('гигабайты'):
        b = b * 8589934592
    if x == ('килобайты'):
        b = b * 8192
    I = int(input('I=?'))
    x = input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if x == ('байты'):
        I = I * 8
    if x == ('гигабайты'):
        I = I * 8589934592
    if x == ('килобайты'):
        I = I * 8192
    if N==0:
        H=I/(t*b)
    H=N/t
    print(H)
elif x==('t'):
    N = int(input('N=?'))
    H = int(input('H=?'))
    x=input('назови точные еденицы измерения. Гц, гГц, кГц, МГц?')
    if x==('гГц'):
        H=H*100
    if x==('кГц'):
        H=H*1000
    if x==('МГц'):
        H=H*1000000
    K = int(input('K=?'))
    b = int(input('b=?'))
    x = input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if x == ('байты'):
        b = b * 8
    if x == ('гигабайты'):
        b = b * 8589934592
    if x == ('килобайты'):
        b = b * 8192
    I = int(input('I=?'))
    x = input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if x == ('байты'):
        I = I * 8
    if x == ('гигабайты'):
        I = I * 8589934592
    if x == ('килобайты'):
        I = I * 8192
    if N==0:
        t=I/(H*b)
    t=N/H
    print(t)
elif x==('N'):
    t = int(input('t=?'))
    z = input('секунды или минуты? Пиши слово с мелкой буквы')
    if z == ('минуты'):
        t = t * 60
    H = int(input('H=?'))
    x = input('назови точные еденицы измерения. Гц, гГц, кГц, МГц?')
    if x == ('гГц'):
        H = H * 100
    if x == ('кГц'):
        H = H * 1000
    if x == ('МГц'):
        H = H * 1000000
    N=H*t
    print(N)
elif x==('K'):
    t = int(input('t=?'))
    p = input('секунды или минуты? Пиши слово с мелкой буквы')
    if p == ('минуты'):
        t = t * 60
    N = int(input('N=?'))
    H = int(input('H=?'))
    x = input('назови точные еденицы измерения. Гц, гГц, кГц, МГц?')
    if x == ('гГц'):
        H = H * 100
    if x == ('кГц'):
        H = H * 1000
    if x == ('МГц'):
        H = H * 1000000
    b = int(input('b=?'))
    x = input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if x == ('байты'):
        b = b * 8
    if x == ('гигабайты'):
        b = b * 8589934592
    if x == ('килобайты'):
        b = b * 8192
    I = int(input('I=?'))
    x = input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if x == ('байты'):
        I = I * 8
    if x == ('гигабайты'):
        I = I * 8589934592
    if x == ('килобайты'):
        I = I * 8192
    if b==0:
        if t==0:
            t=N/H
        elif H==0:
            H=N/t
        b=I/(H*t)
    K=2**b
    print(K)
elif x==('b'):
    t = int(input('t=?'))
    l = input('секунды или минуты? Пиши слово с мелкой буквы')
    if l == ('минуты'):
        t = t * 60
    N = int(input('N=?'))
    H = int(input('H=?'))
    x = input('назови точные еденицы измерения. Гц, гГц, кГц, МГц?')
    if x == ('гГц'):
        H = H * 100
    if x == ('кГц'):
        H = H * 1000
    if x == ('МГц'):
        H = H * 1000000
    K = int(input('K=?'))
    I = int(input('I=?'))
    x = input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if x == ('байты'):
        I = I * 8
    if x == ('гигабайты'):
        I = I * 8589934592
    if x == ('килобайты'):
        I = I * 8192
    if K==0:
        b=I/(H*t)
        print(b)
    b=math.log2(K)
    print(b)
elif x==('I'):
    t = int(input('t=?'))
    v = input('секунды или минуты? Пиши слово с мелкой буквы')
    if v == ('минуты'):
        t = t * 60
    N = int(input('N=?'))
    H = int(input('H=?'))
    x = input('назови точные еденицы измерения. Гц, гГц, кГц, МГц?')
    if x == ('гГц'):
        H = H * 100
    if x == ('кГц'):
        H = H * 1000
    if x == ('МГц'):
        H = H * 1000000
    K = int(input('K=?'))
    b = int(input('b=?'))
    x = input('биты,байты,гигабайты,килобайты?(напиши слово)')
    if x == ('байты'):
        b = b * 8
    if x == ('гигабайты'):
        b = b * 8589934592
    if x == ('килобайты'):
        b = b * 8192
    if H==0:
        H=N/t
    if t==0:
        t=N/H
    if b==0:
        b=math.log2(K)
    I=H*t*b
    print(I)
